In [2]:
from datascience import *
import numpy as np

%matplotlib inline
import matplotlib.pyplot as plots
plots.style.use('fivethirtyeight')
import warnings
warnings.simplefilter(action='ignore',category=np.VisibleDeprecationWarning)

## Review

In [3]:
census = Table.read_table("nc-est2019-agesex-res.csv")
census.show(6)

**Discussion Question**: I would like to write a function to allow a user to plot the estimate of the population for a given year (2010 through 2020) among a certain demographic ("males", "females", everyone).

Which parts of the following code need to be generalized to write this function?

```python
my_census_table = census.where('SEX',0).select('AGE',
                                'POPESTIMATE2010').where('AGE',are.below(999))

my_census_table.with_columns('Population (in millions)', 
                             my_census_table.column('POPESTIMATE2010')/1e6).plot('AGE',
                                                                 'Population (in millions)')
```

## New material

### Cross-classify with **two-group columns**

In [32]:
cones = Table.read_table("cones.csv")
cones

Flavor     | Color       | Price
strawberry | pink        | 3.55
chocolate  | light brown | 4.75
chocolate  | dark brown  | 5.25
strawberry | pink        | 5.25
chocolate  | dark brown  | 5.25
bubblegum  | pink        | 4.75

In [33]:
cones.group(['Flavor','Color'])

Flavor     | Color       | count
bubblegum  | pink        | 1
chocolate  | dark brown  | 2
chocolate  | light brown | 1
strawberry | pink        | 2

In [34]:
cones.group(['Flavor','Color'], np.average)

Flavor     | Color       | Price average
bubblegum  | pink        | 4.75
chocolate  | dark brown  | 5.25
chocolate  | light brown | 4.75
strawberry | pink        | 4.4

### Cross-classify with **pivoting**

In [5]:
cones.pivot('Flavor','Color')

Color       | bubblegum | chocolate | strawberry
dark brown  | 0         | 2         | 0
light brown | 0         | 1         | 0
pink        | 1         | 0         | 2

In [6]:
cones.pivot('Flavor','Color','Price',np.average)

Color       | bubblegum | chocolate | strawberry
dark brown  | 0         | 5.25      | 0
light brown | 0         | 4.75      | 0
pink        | 4.75      | 0         | 4.4

_______

### Know when to use grouping vs. pivoting!

In [37]:
# https://corgis-edu.github.io/corgis/csv/skyscrapers/
skyscrapers = Table.read_table('skyscrapers.csv')
skyscrapers.show(6)

#### **Task:** 
- For each city, find the tallest building per material, as of 2016.

In [39]:
skyscrapers.select('material', 'city', 
                   'height').group(['city', 'material'], collect=max)

city      | material        | height max
Atlanta   | concrete        | 264.25
Atlanta   | mixed/composite | 311.8
Atlanta   | steel           | 169.47
Austin    | concrete        | 208.15
Austin    | steel           | 93.6
Baltimore | concrete        | 161.24
Baltimore | steel           | 155.15
Boston    | concrete        | 121.92
Boston    | mixed/composite | 139
Boston    | steel           | 240.79
... (81 rows omitted)

#### **Task:** 
- For each city, find the height difference between the tallest steel building and the tallest concrete building.

In [43]:
skyscrapers_pivoted = skyscrapers.pivot('material', 'city', 
                                        values='height', collect=max)
skyscrapers_pivoted.show()

In [47]:
skyscrapers_pivoted = skyscrapers_pivoted.with_column(
    'difference', 
    abs(skyscrapers_pivoted.column('steel') - 
        skyscrapers_pivoted.column('concrete'))
)

In [48]:
skyscrapers_pivoted.sort('difference', True)

city              | concrete | mixed/composite | steel  | difference
Sunny Isles Beach | 196      | 0               | 0      | 196
Las Vegas         | 350.22   | 195.68          | 164.6  | 185.62
Miami Beach       | 170.39   | 0               | 0      | 170.39
Pittsburgh        | 89.3     | 172             | 256.34 | 167.04
Los Angeles       | 145.7    | 118.26          | 310.29 | 164.59
Philadelphia      | 157.89   | 296.73          | 288.04 | 130.15
Boston            | 121.92   | 139             | 240.79 | 118.87
Austin            | 208.15   | 0               | 93.6   | 114.55
Seattle           | 138.69   | 284.38          | 235.31 | 96.62
Atlanta           | 264.25   | 311.8           | 169.47 | 94.78
... (25 rows omitted)

**Discussion Question**: I would like to make a visualization of the distribution of material types of buildings among each of San Francisco, New York and Chicago. Which cross-classification method is best for this? 
- *Hint:* Which cross classification method produces a table which can be used to create the plot?

_______

### Combine information in different tables via **joining**

In [10]:
drinks = Table().with_columns("Drink", make_array('Milk Tea', 'Espresso', 'Latte','Espresso'),
                              "Cafe", make_array('Asha','Strada','Strada','FSM'),
                              "Price", make_array(5.5,1.75,3.25,2))
drinks

Drink    | Cafe   | Price
Milk Tea | Asha   | 5.5
Espresso | Strada | 1.75
Latte    | Strada | 3.25
Espresso | FSM    | 2

In [11]:
discounts = Table().with_columns("Coupon", make_array('10%','25%','5%'),
                                "Location",make_array('Asha','Strada','Asha'))
discounts

Coupon | Location
10%    | Asha
25%    | Strada
5%     | Asha

In [14]:
drinks.join('Cafe',discounts,'Location')

Cafe   | Drink    | Price | Coupon
Asha   | Milk Tea | 5.5   | 10%
Asha   | Milk Tea | 5.5   | 5%
Strada | Espresso | 1.75  | 25%
Strada | Latte    | 3.25  | 25%

In [15]:
discounts.join('Location',drinks,'Cafe')

Location | Coupon | Drink    | Price
Asha     | 10%    | Milk Tea | 5.5
Asha     | 5%     | Milk Tea | 5.5
Strada   | 25%    | Espresso | 1.75
Strada   | 25%    | Latte    | 3.25